{
    "column_width": {
        "1": 172, 
        "4": 271
    }, 
    "table_data": {
        "data": [
            [
                "key", 
                "Skill", 
                "Skillname", 
                "Belongingunit", 
                "Skilltype0passive1generalattack2skill", 
                "Attackmethod", 
                "Attackrange", 
                "Scopeaffectsparameters", 
                "Basicdamagemultiplier", 
                "Basicdamagecharging", 
                "Skillduration", 
                "Bulleteffectrange", 
                "Numberofbullets", 
                "Bulletspeed", 
                "Bulletcollision", 
                "Numberofcatapults", 
                "Ingamedescription", 
                "Skilldescription", 
                "Exchargingtimes", 
                "Strengthenskilldescription", 
                "value", 
                "Funintroduction", 
                ""
            ], 
            [
                "int", 
                "ability_type", 
                "string", 
                "int", 
                "int", 
                "int", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "float", 
                "string", 
                "string", 
                "int", 
                "string", 
                "string", 
                "string", 
                ""
            ], 
            [
                "100400", 
                100400, 
                "Time Acceleration", 
                "1004", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "When causing damage, briefly increase your own movement speed.", 
                "When dealing damage to enemies, provide a value_2% movement speed bonus of value_1 seconds", 
                "", 
                "", 
                "[2, 10]", 
                "Now it's Mucheng time!", 
                ""
            ], 
            [
                "100410", 
                100410, 
                "The Blade of Time and Space", 
                "1004", 
                "1", 
                "1", 
                "500.0", 
                "300.0", 
                "0.9", 
                "25.0", 
                "0.5", 
                "0.0", 
                "1.0", 
                "1200.0", 
                "300.0", 
                "0.0", 
                "Mu Cheng used his short sword to stab forward. Every third attack will release a shockwave.", 
                "Deals basic damage multiplier damage to enemies within the specified attack range code distance, and hits a shockwave every third attack, flying value_1 distance", 
                "", 
                "", 
                "[1200]", 
                "Cleaning time is up!", 
                ""
            ], 
            [
                "100420", 
                100420, 
                "Loop around", 
                "1004", 
                "2", 
                "5", 
                "800.0", 
                "360.0", 
                "1.8", 
                "10.0", 
                "0.5", 
                "0.0", 
                "0", 
                "0.0", 
                "0.0", 
                "0", 
                "Mu Cheng unleashes a powerful circular slash, dealing damage and slowing down surrounding enemies. NnEX effect  Simultaneously firing reverse time bullets in all directions. The time of the enemy being hit will come to a standstill.", 
                "Deal basic damage multiplier damage to all enemies within the nearby attack range and slow down value_1% for value_2 seconds. If it hits the enemy, strengthen the next regular attack to the third stage.", 
                "3", 
                "Deal basic damage multiplier damage to all enemies in the vicinity (attack range value_3) and slow down value_1% for value_2 seconds. Simultaneously release clock projectiles in four directions around the clock, and the clock projectiles will slowly move outward for value-4 seconds. Enemies standing on the clock will be stationary in time. If it hits the enemy, strengthen the next regular attack to the third stage.", 
                "[10, 2, 1.5, 3]", 
                "The World！", 
                ""
            ], 
            [
                "100500", 
                100500, 
                "Void God", 
                "1005", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Deal additional damage to enemies in a mobile damaged state. Movement damage  including effects such as deceleration and confinement.", 
                "Deal value_1% additional damage to enemies under control", 
                "", 
                "", 
                "[15]", 
                "The world of emptiness, with no return", 
                ""
            ], 
            [
                "100510", 
                100510, 
                "Time-delay force field", 
                "1005", 
                "1", 
                "2", 
                "1000.0", 
                "270.0", 
                "1.0", 
                "25.0", 
                "0.3", 
                "250.0", 
                "1.0", 
                "600.0", 
                "80.0", 
                "0.0", 
                "Liuli threw an energy bullet. When the energy bomb lands, it will also generate a deceleration zone that lasts for several seconds.", 
                "Throw a bullet towards a designated location, dealing basic damage multiplier damage to enemies within the projectile's effect range, and then leaving a deceleration zone lasting value_1 seconds, causing value_2% deceleration effect on enemies within it", 
                "", 
                "", 
                "[1.5, 15]", 
                "Take a break", 
                ""
            ], 
            [
                "100520", 
                100520, 
                "Exile from another world", 
                "1005", 
                "2", 
                "6", 
                "1200.0", 
                "480.0", 
                "2.0", 
                "10.0", 
                "0.8", 
                "450.0", 
                "0", 
                "900.0", 
                "120.0", 
                "0", 
                "Liuli drives a huge energy bomb to fall from the sky, causing damage to enemies within its range and even flying them away. NnEX Effect  Summon additional small energy bullets to smash around.", 
                "Throw a large energy bomb to a designated location, dealing basic damage multiplier damage and value_ 1 second fly effect to enemies within the effect range of the projectile", 
                "3", 
                "Throw a large energy bullet at a designated location within the attack range, dealing basic damage multiplier damage and value_1 seconds of fly effect to enemies within the effect range of the projectile. Then summon value_3 small bullets to hit a random point within the range, and multiply the damage range and damage coefficient of the small bullets by value_2", 
                "[1, 1.3, 8, 0.5]", 
                "Go to the end of the world", 
                ""
            ], 
            [
                "100600", 
                100600, 
                "Praise of Life Ceremony", 
                "1006", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "When releasing anger skills, it will heal oneself and nearby friendly units.", 
                "When releasing explosive skills, it will heal friendly units within a value_1 distance of itself and the surrounding value_2% of maximum health", 
                "", 
                "", 
                "[1000, 30]", 
                "A hymn to life", 
                ""
            ], 
            [
                "100610", 
                100610, 
                "The Touch of Death", 
                "1006", 
                "1", 
                "1", 
                "1000.0", 
                "90.0", 
                "0.5", 
                "15.0", 
                "0.35", 
                "0.0", 
                "2.0", 
                "1400.0", 
                "70.0", 
                "0.0", 
                "The kite throws two feathers, causing damage to the hit enemy and poisoning them. Poisoning  Damage of 5.5% maximum health per second.", 
                "Throw two bullets back and forth in the specified direction, dealing basic damage multiplier damage to the first hit enemy, while also attaching poisoning effects to the target, dealing value_1 multiplier damage every 0.5 seconds for value_2 seconds; Poisoning  Damage of 5.5% maximum health per second", 
                "", 
                "", 
                "[0.2,2]", 
                "Sorry, life is always like this", 
                ""
            ], 
            [
                "100620", 
                100620, 
                "Withered Illusion", 
                "1006", 
                "2", 
                "6", 
                "1000.0", 
                "260.0", 
                "1.0", 
                "5.0", 
                "0.3", 
                "260.0", 
                "0", 
                "0.0", 
                "0.0", 
                "0", 
                "The kite throws a cloud of poisonous mist, causing damage to enemies within its hit range and summoning an illusion at the landing point. Illusions slow down surrounding enemies and explode when they disappear, poisoning them. NnEX Effect  Summons three additional illusions.", 
                "Summon value_1 illusions, which will advance and target enemies within value_2 for pursuit; Illusions will continuously cause a deceleration effect of value-6 on enemies within the value-4 range around them; After phantom death, it will explode and cause poisoning effects on enemies within value_5", 
                "3", 
                "Summon value_3 EX illusions, which will advance and target enemies within value_2 for pursuit; Illusions will continuously cause a deceleration effect of value-6 on enemies within the value-4 range around them; After phantom death, it will explode and cause poisoning effects on enemies within value_5", 
                "[1, 4000, 3, 400, 800, 20, 900, 0.5]", 
                "Please.", 
                ""
            ], 
            [
                "100700", 
                100700, 
                "long-cherished wish", 
                "1007", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "When Mihua is injured, he will briefly increase his attack power.", 
                "Get value_1% damage bonus when injured, lasting value_2 seconds", 
                "", 
                "", 
                "[10, 4]", 
                "Okay so painful", 
                ""
            ], 
            [
                "100710", 
                100710, 
                "Goddess's Fountain of Blood", 
                "1007", 
                "1", 
                "5", 
                "600.0", 
                "180.0", 
                "1.0", 
                "25.0", 
                "0.6", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "Mihua swings the giant sickle and deals damage to enemies in a large area ahead. For every three injuries sustained by N Mihua, she will hit several additional Crow Spirits in her next attack, causing extra damage.", 
                "Deal damage to enemies within the fan-shaped area. For every three injuries, an additional number of Crow bullets are fired during the attack, flying within the value_1 range and causing value_2 coefficient damage.", 
                "", 
                "", 
                "[1000, 1, 15]", 
                "Carrying the revenge of death", 
                ""
            ], 
            [
                "100720", 
                100720, 
                "Dark Crow Blood Festival", 
                "1007", 
                "2", 
                "5", 
                "800.0", 
                "360.0", 
                "1.0", 
                "5.0", 
                "0.5", 
                "0.0", 
                "0", 
                "0.0", 
                "0.0", 
                "0", 
                "Mihua unleashes the power of the sickle, forming a dead link between himself and surrounding enemies, causing sustained damage to the linked enemies while healing himself. NnEX effect  Expanded link range.", 
                "Deal damage to nearby enemies. Simultaneously link all hit hero units for value_1 seconds, deal value_2 damage to the target every second, and restore value_3 percentage health to oneself. When the distance between the target and oneself is greater than the skill attack distance, the link will be forcibly disconnected.", 
                "3", 
                "Deal damage to nearby enemies. Simultaneously link all hit hero units for value_5 seconds, deal value_2 damage to the target every second, and restore value_3 percentage health to oneself. The damage area will gradually increase, with a maximum increase of value-4 times. When the distance between the target and oneself is greater than the skill attack distance, the link will be forcibly disconnected.", 
                "[3, 0.3, 6, 1.5, 5, 0.2, 1]", 
                "Dark crows dance wildly", 
                ""
            ], 
            [
                "100800", 
                100800, 
                "Scorpion tail needle", 
                "1008", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Shia also applies markers to enemies when dealing damage, which detonate after a brief delay and cause damage. During the marking period, each damage to the target will increase the detonation damage.", 
                "Damage will mark the enemy, and the imprint will delay value_1 explosion and cause damage. The basic damage coefficient is value_2. During the duration of the imprint, each damage received will increase the final damage coefficient by value_3", 
                "", 
                "", 
                "[3, 0.1, 0.01]", 
                "I've set my sights on you", 
                ""
            ], 
            [
                "100810", 
                100810, 
                "Dance of the Wheel of Death", 
                "1008", 
                "1", 
                "5", 
                "800.0", 
                "45.0", 
                "0.3", 
                "10.0", 
                "0.45", 
                "0.0", 
                "3.0", 
                "1500.0", 
                "70.0", 
                "0.0", 
                "Shia fired multiple energy bullets towards the front. The energy bomb will also turn back, causing secondary damage.", 
                "Shoot multiple bullets in a fan-shaped direction, and the bullets will return after flying to the farthest point.", 
                "", 
                "", 
                "[3]", 
                "Give up your life", 
                ""
            ], 
            [
                "100820", 
                100820, 
                "Black spiral", 
                "1008", 
                "2", 
                "1", 
                "1000.0", 
                "100", 
                "0.7", 
                "12.0", 
                "0.4", 
                "0.0", 
                "0", 
                "0.0", 
                "0.0", 
                "0", 
                "Shia sprints towards the target direction, dealing damage to enemies along the way, and briefly enters stealth mode after sprinting. NnEX effect  During sprinting, a residual shadow will still be left in place. After a brief delay, the afterimage flew back to its own location, dealing damage to enemies along the way while increasing its own movement speed.", 
                "Sprint towards the target direction at a speed of value_1, dealing value_2 damage to enemies along the way. After sprinting, enter stealth mode for value_1 seconds", 
                "3", 
                "Sprint towards the target direction at a speed of value_1, dealing value_2 damage to enemies along the way. After n displacement, increase your own value_3% movement speed for value_3 seconds. When n is released, it leaves a residual shadow in place. After value_5 seconds, the residual shadow will rush towards itself at the same speed, causing the same damage to the enemies it touches.", 
                "[4000, 3, 30, 4, 0.8, 1]", 
                "I won't let you go", 
                ""
            ], 
            [
                "100900", 
                100900, 
                "world", 
                "1009", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "When Moira is in the team, you can hold two types of consumables at the same time.", 
                "Your team consumables slot+1", 
                "", 
                "", 
                "", 
                "Follow the guidance of fate", 
                ""
            ], 
            [
                "100910", 
                100910, 
                "magician", 
                "1009", 
                "1", 
                "1", 
                "1100.0", 
                "80.0", 
                "0.35", 
                "18.0", 
                "0.5", 
                "275.0", 
                "3.0", 
                "2000.0", 
                "80.0", 
                "0.0", 
                "Moira threw three sharp cards forward.", 
                "Play three cards in the designated direction, dealing damage to the hit enemy.", 
                "", 
                "", 
                "", 
                "The game has started!", 
                ""
            ], 
            [
                "100920", 
                100920, 
                "Wheel of Fate", 
                "1009", 
                "2", 
                "1", 
                "1000.0", 
                "100", 
                "0.0", 
                "0.0", 
                "0.5", 
                "275.0", 
                "0", 
                "0.0", 
                "0.0", 
                "0", 
                "Perform a draw to strengthen the next attack  n [Stars] will throw an additional large number of cards in the next attack. The next attack by the moon will cause a significant deceleration effect. The next attack by the sun will cause an additional explosion, causing range damage and destroying buildings. NnEX effect  Simultaneously achieve the three strengthening effects mentioned above.", 
                "BUFF obtained by drawing cards lasts for value_1 seconds, with n stars  an additional value_2 card is played; Moon  hitting causes a value_3% deceleration effect, lasting value_3 seconds; Sun  When a bullet disappears, it deals value_5 coefficient damage to enemies within its effect range", 
                "3", 
                "", 
                "[5, 8, 30, 2.5, 0.75]", 
                "My turn! Draw a card!", 
                ""
            ], 
            [
                "101000", 
                101000, 
                "Redemption", 
                "1010", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Sebas applies a shield to your character every once in a while (regardless of whether Sebas is present or not)", 
                "Generate value_2 shields for your character every value_1 seconds (regardless of whether Sebas is present or not)", 
                "", 
                "", 
                "[12, 80]", 
                "I won't fulfill your wish", 
                ""
            ], 
            [
                "101010", 
                101010, 
                "Shenyou Holy Light", 
                "1010", 
                "1", 
                "6", 
                "1200.0", 
                "160.0", 
                "0.3", 
                "10.0", 
                "0.65", 
                "0.0", 
                "5.0", 
                "1800.0", 
                "60.0", 
                "0.0", 
                "Sebas tapped his scepter and emitted five holy lights.", 
                "Sebas strikes the scepter and shoots five holy lights to attack the target point", 
                "", 
                "", 
                "", 
                "Face the Holy Light", 
                ""
            ], 
            [
                "101020", 
                101020, 
                "Divine protection", 
                "1010", 
                "2", 
                "6", 
                "1000.0", 
                "0.0", 
                "1.0", 
                "0.0", 
                "0.5", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "Sebas uses his divine power to add shields that can withstand certain damage to himself and his allies within his range. When the shield breaks, it will repel nearby enemies and cause damage. NnEX effect  Obtain triple shield while briefly increasing one's own movement speed.", 
                "Sebas uses his divine power to add shields that can withstand value_1 damage to himself and his allies within his range. The shields last for value_2 seconds, and when they break, they will repel nearby value_3 enemies and deal damage", 
                "3", 
                "Multiply the shield amount by value-4 times and obtain a value-6% movement speed bonus that lasts for value_5 seconds", 
                "[100, 6, 850, 3, 3, 30]", 
                "God, stand with me", 
                ""
            ], 
            [
                "101300", 
                101300, 
                "Anti dog sense of smell", 
                "1013", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Every once in a while, Douzi will explore the surrounding enemies, make them visible, and apply markers. Dou Zi's general attack can detonate markers to deal additional damage and repel enemies.", 
                "Every value_1 second, mark the enemy within the value_2 range for value_3 seconds and gain their field of view. The attack can detonate the mark, causing additional damage of value_2 coefficient and repelling the enemy", 
                "", 
                "", 
                "[8, 1200, 4, 0.2, 0.2, 400, 15]", 
                "Exclusive sense of justice!", 
                ""
            ], 
            [
                "101310", 
                101310, 
                "Justice Decision", 
                "1013", 
                "1", 
                "5", 
                "1050.0", 
                "40.0", 
                "0.4", 
                "20.0", 
                "0.35", 
                "0.0", 
                "5.0", 
                "2200.0", 
                "25.0", 
                "0.0", 
                "Dou Zi fired multiple projectiles in a wide range towards the front.", 
                "Shoot a shotgun at the fan-shaped area to deal damage to the hit enemy", 
                "", 
                "", 
                "", 
                "You have been arrested!", 
                ""
            ], 
            [
                "101320", 
                101320, 
                "Desperate Three Headed Dog", 
                "1013", 
                "2", 
                "5", 
                "1200.0", 
                "40.0", 
                "0.6", 
                "3.0", 
                "0.65", 
                "0.0", 
                "8.0", 
                "1500.0", 
                "30.0", 
                "0.0", 
                "Dou Zi awakens the three headed dog of hell and shoots a large number of bullets forward, which will repel enemies and destroy obstacles. NnEX Effect  The three headed dog fully awakens and releases three waves of bullets continuously!", 
                "Launch a large number of bullets into the fan-shaped area, which will repel enemies along the way and destroy buildings within a 1-second distance", 
                "3", 
                "The three headed dog fully awakens and unleashes its ultimate move three times in a row!", 
                "[0.2, 200, 1]", 
                "Let's erupt freely!", 
                ""
            ], 
            [
                "101400", 
                101400, 
                "horn", 
                "1014", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "After standing still for a while, Nami's attack will shoot more rockets.", 
                "After 1 second of staying still, shoot an additional value_2 bullet", 
                "", 
                "", 
                "[2, 2]", 
                "Enter siege mode!", 
                ""
            ], 
            [
                "101410", 
                101410, 
                "Portable heavy artillery", 
                "1014", 
                "1", 
                "1", 
                "1300.0", 
                "90.0", 
                "1.0", 
                "25.0", 
                "0.45", 
                "180.0", 
                "1.0", 
                "1700.0", 
                "70.0", 
                "0.0", 
                "Nami fired a rocket, which exploded upon hitting the enemy or flying to the farthest point, causing range damage.", 
                "Shoot a missile in a straight line, hit the enemy or fly to the farthest point to explode, causing damage to nearby enemies;", 
                "", 
                "", 
                "[]", 
                "Is this one Not sinking!", 
                ""
            ], 
            [
                "101420", 
                101420, 
                "Siege blasting", 
                "1014", 
                "2", 
                "2", 
                "1500.0", 
                "400.0", 
                "0.75", 
                "10.0", 
                "0.7", 
                "300.0", 
                "4.0", 
                "3000.0", 
                "80.0", 
                "0.0", 
                "Nami shoots a large number of rockets, causing range damage and can also destroy obstacles. NnEX effect  More rockets are launched, and the explosion will continue to burn the enemies around the landing point.", 
                "Shoot multiple bullets within the target range, causing damage and destroying buildings", 
                "3", 
                "Extra value_1 bullets will be fired, and the bullets will burn the ground, causing value_2 multiplier damage every 0.5 seconds for value_3 seconds", 
                "[2, 0.5, 3]", 
                "Fire in the hole!", 
                ""
            ], 
            [
                "101200", 
                101200, 
                "Prophecy of Stars", 
                "1012", 
                "0", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Linke is blessed by the stars. When Linke was present, stardust continued to form on the map. When picking up stardust, it will shoot stardust bullets in all directions and briefly increase its own movement speed.", 
                "Picking up star dust will shoot value_1 bullets in all directions, while briefly increasing its own value_2 movement speed for value_3 seconds. Every value_2, randomly generate value_5 star dust on the map.", 
                "", 
                "", 
                "[5, 20, 3, 2.5, 1]", 
                "I heard it The Voice of the Future", 
                ""
            ], 
            [
                "101210", 
                101210, 
                "Scattered star dust", 
                "1012", 
                "1", 
                "5", 
                "1000.0", 
                "30.0", 
                "0.35", 
                "10.0", 
                "0.5", 
                "0.0", 
                "5.0", 
                "1700.0", 
                "60.0", 
                "0.0", 
                "Linke fired multiple Stardust bullets towards the front.", 
                "Stardust shoots several Stardust bullets towards the fan-shaped area, dealing damage to the hit enemy;", 
                "", 
                "", 
                "[]", 
                "Star dust shattered", 
                ""
            ], 
            [
                "101220", 
                101220, 
                "Mini black hole", 
                "1012", 
                "2", 
                "1", 
                "1600.0", 
                "120.0", 
                "1.0", 
                "15.0", 
                "0.4", 
                "420.0", 
                "1.0", 
                "1600.0", 
                "100.0", 
                "0.0", 
                "Linke throws a mini black hole that deals sustained damage and draws enemies to the center of the black hole. NnEX effect  simultaneously throw three black holes!", 
                "Linke throws a mini black hole, which spreads and deals basic damage when hitting enemies, while attracting enemies within range to the center, causing value_1 multiplier damage every second. After value_2, it explodes and deals value_3 multiplier damage;", 
                "3", 
                "Throw three mini black holes", 
                "[0.3, 5, 2]", 
                "The power from the stars", 
                ""
            ], 
            [
                "101500", 
                101500, 
                "Eating in large chunks", 
                "1015", 
                "0", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "When the enemy is defeated by Dada, they will drop delicious meat pieces. Dada picking up meat chunks can restore life and increase movement speed.", 
                "When killing enemies, value_1 pieces of meat will be dropped. Meat chunks  Pick up and provide value_2% health recovery and value_3 seconds of value_2% acceleration effect", 
                "", 
                "", 
                "[2, 15, 2, 15]", 
                "Prohibition of food waste", 
                ""
            ], 
            [
                "101510", 
                101510, 
                "Heavyweight Spoon", 
                "1015", 
                "1", 
                "5", 
                "1000.0", 
                "75.0", 
                "1.5", 
                "25.0", 
                "0.88", 
                "100.0", 
                "1.0", 
                "1200.0", 
                "60.0", 
                "0.0", 
                "Dada swung the big pot and smashed it hard, causing damage to the enemy ahead. The closer the enemy is, the higher the damage they receive!", 
                "Swing the pot to store energy for a period of time and forcefully smash it, causing damage to enemies within a fan-shaped range through the shock wave. The damage will gradually decrease with distance, and for every value_1 distance, the damage will decrease by a multiple of value_2 (reduced to the base damage multiplier).", 
                "", 
                "", 
                "[100, 0.1]", 
                "Your cooking is terrible!", 
                ""
            ], 
            [
                "101520", 
                101520, 
                "Binge eating time", 
                "1015", 
                "2", 
                "3", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "1.3", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "Dada, open the lid of the pot and enjoy the delicious meal! Treat yourself immediately, increase your movement speed, and expand the attack range for the next attack! NnEX Effect  Further increase attack range!", 
                "Open the lid of the pot and enjoy a delicious meal! Provide a one-time value_1% health recovery and a value_3% acceleration effect lasting value_2 seconds; Simultaneously strengthen the next attack and expand the range by value_5;", 
                "3", 
                "Open the lid of the pot and enjoy a delicious meal! Provide a one-time value_1% health recovery and a value_3% acceleration effect lasting value_2 seconds; Simultaneously strengthen the next attack and expand the range to value_7;", 
                "[50, 6, 20,1.5 , 500, 2, 1000]", 
                "Eat it all!", 
                ""
            ], 
            [
                "101600", 
                101600, 
                "Life is hanging by a thread", 
                "1016", 
                "0", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Fill your anger when killing a hero", 
                "Fill your anger when killing a hero", 
                "", 
                "", 
                "[]", 
                "Friction, friction!", 
                ""
            ], 
            [
                "101610", 
                101610, 
                "Soul Sword of Life", 
                "1016", 
                "1", 
                "1", 
                "920.0", 
                "310.0", 
                "1.0", 
                "25.0", 
                "0.6", 
                "0.0", 
                "1.0", 
                "1500.0", 
                "160.0", 
                "0.0", 
                "Ruby waved the scissors and sent out a shockwave, causing the bullet to gradually shrink during flight;", 
                "Ruby waved the scissors and sent out a shockwave, causing the bullet to gradually shrink during flight;", 
                "", 
                "", 
                "[]", 
                "Cut it and take a look!", 
                ""
            ], 
            [
                "101620", 
                101620, 
                "End of life", 
                "1016", 
                "2", 
                "6", 
                "1350.0", 
                "360.0", 
                "2.0", 
                "25.0", 
                "1.3", 
                "360.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "0.0", 
                "Lu Gao jumps high and rushes towards the target position, cutting off the enemy's fate line, dealing damage to units within the target range and reducing their attack energy by one grid. NEX Effect  Six regular attack bullets are fired around when landing", 
                "Lu Gao jumps high and rushes towards the target position, cutting off the enemy's fate line, dealing damage to units within the target range and reducing their value_1 general attack energy. Flight process value_3 seconds", 
                "3", 
                "When landing, shoot value_2 general attack bullets towards the surrounding area", 
                "[100, 6, 0.8]", 
                "make a clean break with!", 
                ""
            ], 
            [
                "101100", 
                101100, 
                "Golden Clan", 
                "1011", 
                "0", 
                "0", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "Win+1 gold coin when defeating enemies, and -1 gold coin when dying", 
                "Defeat the enemy to earn coins+value_1, and upon death, earn coins - value_2", 
                "", 
                "", 
                "[1, 1]", 
                "Who allowed you to speak", 
                ""
            ], 
            [
                "101110", 
                101110, 
                "Jinyi Guanchong", 
                "1011", 
                "1", 
                "1", 
                "450.0", 
                "250.0", 
                "1.0", 
                "15.0", 
                "0.6", 
                "0.0", 
                "0.0", 
                "2000.0", 
                "120.0", 
                "0.0", 
                "Short press  impact a short distance and deal damage. Long press  start charging, the longer the charging time, the longer the attack distance, and at the same time, fire bullets according to the charging time", 
                "Short press  Impact a short distance and cause damage. The default distance is the release distance, the speed is the bullet speed, and the collision is a bullet collision. Long press  Start charging, with each charging for 0.5 seconds, the charging distance increases by value_1, and an additional value_2 bullet is scattered. The bullet travels with itself, causing value_3 coefficient damage, with a maximum charging time of 1.5 seconds", 
                "", 
                "", 
                "[250, 2, 0.4]", 
                "A magnificent shot!", 
                ""
            ], 
            [
                "101120", 
                101120, 
                "Golden Umbrella", 
                "1011", 
                "2", 
                "6", 
                "400.0", 
                "450.0", 
                "1.5", 
                "10.0", 
                "2.26", 
                "180.0", 
                "3.0", 
                "1500.0", 
                "80.0", 
                "0.0", 
                "Open the golden umbrella and shoot down the flying object in front within 2 seconds; Then shoot three rays, which will explode and damage the building after hitting the unit or obstacle. For each flying object absorbed, an additional ray will be shot, up to a maximum of ten; Releasing the skill again can prematurely end it; nEX： Release simultaneously towards the rear", 
                "Open the golden umbrella and shoot down the flying object in front within 2 seconds; Strike the basic number of bullets, number of bullets, flight distance value_1, speed bullet velocity, collision bullet collision, explosion range after hitting, bullet effect range. Release again to end the skill prematurely; nEX： Release simultaneously towards the rear", 
                "3", 
                "Release simultaneously towards the rear", 
                "[1000]", 
                "No Entry!", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ], 
            [
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                "", 
                ""
            ]
        ], 
        "key": [
            0
        ]
    }, 
    "table_type": 0, 
    "tid": "ca5738d1-5667-402d-9b1e-2bdd31301db2"
}